# Part 1

# Import Analysis libraries

In [151]:
# Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt 
import seaborn as sns
import scipy

# Import Data Frame

In [153]:
# Create path 
path = r'C:\users\Ali Hassan\Documents\MM-2020 Instacart Basket Analysis'

In [154]:
# Import new 'customer.csv' dataframe.
customers = pd.read_csv(os.path.join(path, 'Data', 'Original data', 'customers.csv'))

In [155]:
# Check new dataframe.
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [156]:
# Check dimension of dataframe.
customers.shape

(206209, 10)

In [157]:
# Check Descriptive statistics
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [158]:
# Check datatypes.
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Wrangle the Dataset.

In [160]:
# Rename the columns.
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [161]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [162]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [163]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [164]:
customers.rename(columns ={'STATE' : 'state'}, inplace = True)

In [165]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [166]:
# Check columns.
customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [167]:
# The columns have been successfuly renamed.

In [168]:
customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Data Quality and Consistency checks.

In [170]:
# Check data types and mixed data types in dataframe.
customers.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [171]:
# Checking for mixed data types in each column.
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print (col)

first_name

In [172]:
# Output shows that 'first_name' column have mixed data-types that need to be addressed.
customers['first_name'] = customers['first_name'].astype('str')

In [173]:
# 'user_id' column, while not containing mixed data-types, is till improperly listed as an integer
customers['user_id'] = customers['user_id'].astype('str')

In [174]:
customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [175]:
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print (col)

In [176]:
# Now all columns are appropriate data-types and no mixed data-types are present.

In [177]:
# Check for missing data.
customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [178]:
# Check for full duplicates.
customers_dups = customers[customers.duplicated()]

In [179]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [180]:
# check Descriptive statistics.
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

# Combine Customer data with the prepared Instacart data.

In [182]:
# Import dataframe.
orders_products = pd.read_pickle(os.path.join(path, 'Data', 'Prepared data', 'aggregated_ords_prods_merge.pkl'))

In [183]:
# Check shape.
orders_products.shape

(3101292, 24)

In [184]:
# Check shape.
customers.shape

(206209, 10)

In [185]:
# Identify shared column.
orders_products.head(5)

,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,product_name,...,price_range_loc,Busiest_day,Busiest days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,customer_frequency,frequency_flag
order_id,,,,,,,,,,,,,,,,,,,,,
2539329,1,1,2,8,NaN,196,1,0,both,Soda,...,Mid range product,Regular busy,Regularly busy,Average orders,10,New customer,14.0,High_spender,20.5,Non_frequent_customer
2539329,1,1,2,8,NaN,14084,2,0,both,Organic Unsweetened Vanilla Almond Milk,...,Mid range product,Regular busy,Regularly busy,Average orders,10,New customer,14.0,High_spender,20.5,Non_frequent_customer
2539329,1,1,2,8,NaN,12427,3,0,both,Original Beef Jerky,...,Low range product,Regular busy,Regularly busy,Average orders,10,New customer,14.0,High_spender,20.5,Non_frequent_customer
2539329,1,1,2,8,NaN,26088,4,0,both,Aged White Cheddar Popcorn,...,Low range product,Regular busy,Regularly busy,Average orders,10,New customer,14.0,High_spender,20.5,Non_frequent_customer
2539329,1,1,2,8,NaN,26405,5,0,both,XL Pick-A-Size Paper Towel Rolls,...,Low range product,Regular busy,Regularly busy,Average orders,10,New customer,14.0,High_spender,20.5,Non_frequent_customer

In [186]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [187]:
# Both datframes share the 'user_id' column
# Check data-type of shared column
orders_products.dtypes['user_id']

dtype('int64')

In [188]:
customers.dtypes['user_id']

dtype('O')

In [189]:
# Make both dataframes of same data-type
orders_products['user_id'] = orders_products['user_id'].astype('str')

In [190]:
orders_products.dtypes['user_id']

dtype('O')

In [191]:
# Now both dataframes have same data-type

In [192]:
# Drop the existing '_merge' column from previous exercise
orders_products = orders_products.drop(columns=['_merge'])

In [193]:
# Merge both dataframes using the column 'user_id' as the shared column with the default join (inner)

In [194]:
cust_ords_prods = orders_products.merge(customers, on = 'user_id', indicator = True)

In [195]:
# This new dataframe combines both the customers data and orders_products dataframe and use the 'user_id' column as its key

In [196]:
# Check shape
cust_ords_prods.shape

(3101292, 33)

In [197]:
cust_ords_prods.head(5)

,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,1,1,2,8,NaN,196,1,0,Soda,77,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,23,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,23,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [198]:
# Check inner join value counts
cust_ords_prods['_merge'].value_counts()

_merge
both          3101292
left_only           0
right_only          0
Name: count, dtype: int64

In [199]:
# Check data types
cust_ords_prods.dtypes

user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Match                       object
price_range_loc             object
Busiest_day                 object
Busiest days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
_merge                    category
dtype: object

# Export Dataframe

In [201]:
cust_ords_prods.to_pickle(os.path.join(path, 'Data', 'Prepared data', 'orders_products_customers_merged.pkl'))